Tekla Open API Reference for Tekla Structures 2025
WpfSaveLoad.HelpOpenClicked Event
 The HelpOpenClicked event is triggered just after the help button has been clicked.
 Namespace: Tekla.Structures.Dialog.UIControls
 Assembly: Tekla.Structures.Dialog (in Tekla.Structures.Dialog.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public event EventHandler HelpOpenClicked
Public Event HelpOpenClicked As EventHandler
Value
Type: System.EventHandler
See Also
Reference
WpfSaveLoad Class
Tekla.Structures.Dialog.UIControls Namespace